CSI API ETABS v1
cPropArea.GetShellLayer Method
 Retrieves area property layer parameters for a shell-type area section.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetShellLayer(
	string Name,
	ref int NumberLayers,
	ref string[] LayerName,
	ref double[] Dist,
	ref double[] Thickness,
	ref string[] MatProp,
	ref bool[] Nonlinear,
	ref double[] MatAng,
	ref int[] NumIntegrationPts
)
Function GetShellLayer (
	Name As String,
	ByRef NumberLayers As Integer,
	ByRef LayerName As String(),
	ByRef Dist As Double(),
	ByRef Thickness As Double(),
	ByRef MatProp As String(),
	ByRef Nonlinear As Boolean(),
	ByRef MatAng As Double(),
	ByRef NumIntegrationPts As Integer()
) As Integer
Dim instance As cPropArea
Dim Name As String
Dim NumberLayers As Integer
Dim LayerName As String()
Dim Dist As Double()
Dim Thickness As Double()
Dim MatProp As String()
Dim Nonlinear As Boolean()
Dim MatAng As Double()
Dim NumIntegrationPts As Integer()
Dim returnValue As Integer
returnValue = instance.GetShellLayer(Name,
	NumberLayers, LayerName, Dist, Thickness,
	MatProp, Nonlinear, MatAng, NumIntegrationPts)
int GetShellLayer(
	String^ Name,
	int% NumberLayers,
	array<String^>^% LayerName,
	array<double>^% Dist,
	array<double>^% Thickness,
	array<String^>^% MatProp,
	array<bool>^% Nonlinear,
	array<double>^% MatAng,
	array<int>^% NumIntegrationPts
)
abstract GetShellLayer :
        Name : string *
        NumberLayers : int byref *
        LayerName : string[] byref *
        Dist : float[] byref *
        Thickness : float[] byref *
        MatProp : string[] byref *
        Nonlinear : bool[] byref *
        MatAng : float[] byref *
        NumIntegrationPts : int[] byref -> int
Parameters
Name
Type: System.String
The name of an existing shell-type area property that is specified to be a layered shell property.
NumberLayers
Type: System.Int32
The number of layers in the area property.
LayerName
Type: System.String[]
This is an array that includes the name of each layer.
Dist
Type: System.Double[]
This is an array that includes the distance from the area reference surface (area object joint location plus offsets) to the mid-height of the layer. [L]
Thickness
Type: System.Double[]
This is an array that includes the thickness of each layer. [L]
MatProp
Type: System.String[]
This is an array that includes the name of the material property for the layer.
Nonlinear
Type: System.Boolean[]
MatAng
Type: System.Double[]
This is an array that includes the material angle for the layer. [deg]
NumIntegrationPts
Type: System.Int32[]
The number of integration points in the thickness direction for the layer. The locations are determined by the program using standard Guass-quadrature rules.
Return Value
Type: Int32
Returns zero if the parameters are successfully retrieved, otherwise it returns a nonzero value.
The function returns an error if the specified area property is not a shell-type property specified to be a layered shell.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Name As String
       Dim MyNumberLayers As Integer
       Dim MyLayerName() As String
       Dim MyDist() As Double
       Dim MyThickness() As Double
       Dim MyNumIntegrationPts() As Integer
       Dim MyMatProp() As String
       Dim MyNonLinear() As Boolean
       Dim MyMatAng() As Double
       Dim NumberLayers As Integer
       Dim LayerName() As String
       Dim Dist() As Double
       Dim Thickness() As Double
       Dim MatProp() As String
       Dim NonLinear() As Boolean
       Dim MatAng() As Double
       Dim NumIntegrationPts() As Integer
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'set new area property
       ret = SapModel.PropArea.SetWall("A1", eWallPropType.Specified, eShellType.Layered, "", 0)
   'add A615Gr60 rebar material
       ret = SapModel.PropMaterial.AddMaterial(Name, eMatType.Rebar, "United States", "ASTM A615", "Grade 60")
   'set area property layer parameters
       MyNumberLayers = 5
       ReDim MyLayerName(MyNumberLayers - 1)
       ReDim MyDist(MyNumberLayers - 1)
       ReDim MyThickness(MyNumberLayers - 1)
       ReDim MyNumIntegrationPts(MyNumberLayers - 1)
       ReDim MyMatProp(MyNumberLayers - 1)
       ReDim MyNonLinear(MyNumberLayers - 1)
       ReDim MyMatAng(MyNumberLayers - 1)
       MyLayerName(0) = "Concrete"
       MyDist(0) = 0
       MyThickness(0) = 16
       MyNumIntegrationPts(0) = 2
       MyMatProp(0) = "4000Psi"
       MyMatAng(0) = 0
       MyLayerName(1) = "Top Bar 1"
       MyDist(1) = 6
       MyThickness(1) = 0.03
       MyNumIntegrationPts(1) = 1
       MyMatProp(1) = Name
       MyMatAng(1) = 0
       MyLayerName(2) = "Top Bar 2"
       MyDist(2) = 6
       MyThickness(2) = 0.03
       MyNumIntegrationPts(2) = 1
       MyMatProp(2) = Name
       MyMatAng(2) = 90
       MyLayerName(3) = "Bot Bar 1"
       MyDist(3) = -6
       MyThickness(3) = 0.03
       MyNumIntegrationPts(3) = 1
       MyMatProp(3) = Name
       MyMatAng(3) = 0
       MyLayerName(4) = "Bot Bar 2"
       MyDist(4) = -6
       MyThickness(4) = 0.03
       MyNumIntegrationPts(4) = 1
       MyMatProp(4) = Name
       MyMatAng(4) = 90
       ret = SapModel.PropArea.SetShellLayer("A1", MyNumberLayers, MyLayerName, MyDist, MyThickness, MyMatProp, MyNonLinear, MyMatAng, MyNumIntegrationPts)
   'get area property layer parameters
       ret = SapModel.PropArea.GetShellLayer("A1", NumberLayers, LayerName, Dist, Thickness, MatProp, Nonlinear, MatAng, NumIntegrationPts)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropArea Interface
ETABSv1 Namespace